Revit 2027 API
ImageTypeOptions Constructor
Overload List
Name | Description
ImageTypeOptions(ExternalResourceReference, ImageTypeSource) |  Constructs a new instance of the ImageTypeOptions object.
ImageTypeOptions(String, Boolean, ImageTypeSource)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
This constructor saves an additional setting that indicates whether the imagetype will be a link or an import.
Top
See Also
Reference
ImageTypeOptions Class
Autodesk.Revit.DB Namespace